_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 224, 224, 1)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 224, 224, 64)      640       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 112, 112, 64)      36928     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 112, 112, 128)     73856     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 56, 56, 128)       147584    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 56, 56, 256)       295168    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 28, 28, 256)       590080    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 28, 28, 512)       1180160   
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 28, 28, 512)       2359808   
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 28, 28, 256)       1179904   
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 28, 28, 256)       590080    
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 28, 28, 128)       295040    
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 56, 56, 128)       0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 56, 56, 64)        73792     
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 56, 56, 64)        36928     
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 112, 112, 64)      0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 112, 112, 32)      18464     
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 112, 112, 2)       578       
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 224, 224, 2)       0         
=================================================================
Total params: 6,879,010
Trainable params: 6,879,010
Non-trainable params: 0
_________________________________________________________________
None